; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v5 - type_2 ?v1 - type_1)
 	      (pred_1 ?v7 - object ?v1 - type_1)
	      (pred_3 ?v5 - type_2 ?v2 - type_3)
	      (pred_2 ?v5 - type_2 ?v7 - object ?v2 - type_3))

   (:action op_3
       :parameters  (?v5 - type_2 ?v8 ?v3 - type_1)
       :precondition (and  (pred_4 ?v5 ?v8))
       :effect (and  (pred_4 ?v5 ?v3)
		     (not (pred_4 ?v5 ?v8))))

   (:action op_1
       :parameters (?v5 - type_2 ?v6 - object ?v4 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_1 ?v6 ?v4) (pred_4 ?v5 ?v4) (pred_3 ?v5 ?v2))
       :effect (and (pred_2 ?v5 ?v6 ?v2)
		    (not (pred_1 ?v6 ?v4)) 
		    (not (pred_3 ?v5 ?v2))))

   (:action op_2
       :parameters (?v5 - type_2 ?v6 - object ?v4 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_2 ?v5 ?v6 ?v2) (pred_4 ?v5 ?v4))
       :effect (and (pred_1 ?v6 ?v4)
		    (pred_3 ?v5 ?v2)
		    (not (pred_2 ?v5 ?v6 ?v2)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_06 - type_2
obj_07 obj_03 - type_3
obj_01 obj_09 obj_08 obj_05 - type_1
obj_02 obj_10 obj_04 - object)
(:init
(pred_4 obj_06 obj_01)
(pred_3 obj_06 obj_07)
(pred_3 obj_06 obj_03)
(pred_1 obj_02 obj_09)
(pred_1 obj_10 obj_01)
(pred_1 obj_04 obj_09)
)
(:goal
(and
(pred_1 obj_02 obj_01)
(pred_1 obj_10 obj_09)
(pred_1 obj_04 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_06 ?b obj_03))))
)
)

; plan
1. (op_1 obj_06 obj_10 obj_01 obj_07)
   deleted: (pred_1 obj_10 obj_01) (pred_3 obj_06 obj_07)
   added: (pred_2 obj_06 obj_10 obj_07)
   goals met: 0 of 3
2. (op_3 obj_06 obj_01 obj_09)
   deleted: (pred_4 obj_06 obj_01)
   added: (pred_4 obj_06 obj_09)
   goals met: 0 of 3
3. (op_2 obj_06 obj_10 obj_09 obj_07)
   deleted: (pred_2 obj_06 obj_10 obj_07)
   added: (pred_1 obj_10 obj_09) (pred_3 obj_06 obj_07)
   goals met: 1 of 3
4. (op_1 obj_06 obj_02 obj_09 obj_07)
   deleted: (pred_1 obj_02 obj_09) (pred_3 obj_06 obj_07)
   added: (pred_2 obj_06 obj_02 obj_07)
   goals met: 1 of 3
5. (op_3 obj_06 obj_09 obj_01)
   deleted: (pred_4 obj_06 obj_09)
   added: (pred_4 obj_06 obj_01)
   goals met: 1 of 3
6. (op_2 obj_06 obj_02 obj_01 obj_07)
   deleted: (pred_2 obj_06 obj_02 obj_07)
   added: (pred_1 obj_02 obj_01) (pred_3 obj_06 obj_07)
   goals met: 2 of 3
7. (op_3 obj_06 obj_01 obj_09)
   deleted: (pred_4 obj_06 obj_01)
   added: (pred_4 obj_06 obj_09)
   goals met: 2 of 3
8. (op_1 obj_06 obj_04 obj_09 obj_07)
   deleted: (pred_1 obj_04 obj_09) (pred_3 obj_06 obj_07)
   added: (pred_2 obj_06 obj_04 obj_07)
   goals met: 2 of 3
9. (op_3 obj_06 obj_09 obj_01)
   deleted: (pred_4 obj_06 obj_09)
   added: (pred_4 obj_06 obj_01)
   goals met: 2 of 3
10. (op_2 obj_06 obj_04 obj_01 obj_07)
   deleted: (pred_2 obj_06 obj_04 obj_07)
   added: (pred_1 obj_04 obj_01) (pred_3 obj_06 obj_07)
   goals met: 3 of 3
